In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('carpricetraining.csv')

In [3]:
df.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [4]:
df.sample()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
4631,4631,Ford Fiesta 1.6 ZXi Duratec,Pune,2010,85000,Petrol,Manual,First,15.3 kmpl,1596 CC,101 bhp,5.0,NaN,1.46

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         6019 non-null   int64
 1   Name               6019 non-null   object
 2   Location           6019 non-null   object
 3   Year               6019 non-null   int64
 4   Kilometers_Driven  6019 non-null   int64
 5   Fuel_Type          6019 non-null   object
 6   Transmission       6019 non-null   object
 7   Owner_Type         6019 non-null   object
 8   Mileage            6017 non-null   object
 9   Engine             5983 non-null   object
 10  Power              5983 non-null   object
 11  Seats              5977 non-null   float64
 12  New_Price          824 non-null    object
 13  Price              6019 non-null   float64
dtypes: float64(2), int64(3), object(9)
memory usage: 658.5+ KB

In [6]:
df2=df.drop('Unnamed: 0', axis=1, inplace=False)

In [7]:
df2.sample()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
734,Maruti Swift VDI BSIV,Kolkata,2012,52241,Diesel,Manual,First,25.2 kmpl,1248 CC,74 bhp,5.0,NaN,2.9

In [8]:
df.sample()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
4247,4247,Land Rover Freelander 2 SE,Ahmedabad,2012,75000,Diesel,Automatic,Second,12.39 kmpl,2179 CC,147.51 bhp,5.0,NaN,17.5

In [9]:
df.drop('Unnamed: 0', axis=1, inplace=True)

In [10]:
df.sample()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
4322,Toyota Fortuner 4x2 AT TRD Sportivo,Delhi,2015,36000,Diesel,Automatic,Second,12.55 kmpl,2982 CC,168.7 bhp,7.0,NaN,21.5

In [11]:
df.drop('New_Price', axis=1, inplace=True)

In [12]:
df.sample()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
288,Volkswagen Vento Diesel Highline,Hyderabad,2011,69000,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,4.7

In [13]:
model_names = df['Name'].unique()

In [14]:
model_names

array(['Maruti Wagon R LXI CNG', 'Hyundai Creta 1.6 CRDi SX Option',
       'Honda Jazz V', ..., 'Volkswagen Polo IPL II 1.2 Petrol Highline',
       'Tata Bolt Revotron XT', 'Mahindra Xylo D4 BSIV'], dtype=object)

In [15]:
car_names=df['Name'].str.split(' ', expand=True)

In [16]:
car_companies , car_model = car_names[0], car_names[1]

In [17]:
df['Car_Companies'], df['Car_model'] = car_companies, car_model

In [18]:
df.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Car_Companies,Car_model
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,Maruti,Wagon
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,Hyundai,Creta
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,Honda,Jazz
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,Maruti,Ertiga
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,Audi,A4

In [19]:
df.drop(['Name'], axis=1,inplace=True)

In [20]:
df.head()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Car_Companies,Car_model
0,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,Hyundai,Creta
2,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,Honda,Jazz
3,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,Maruti,Ertiga
4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,Audi,A4

In [21]:
df['Car_model'] = df['Car_model'].apply(lambda x : x.lower())

In [22]:
df.head()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Car_Companies,Car_model
0,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,Maruti,wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,Hyundai,creta
2,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,Honda,jazz
3,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,Maruti,ertiga
4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,Audi,a4

In [23]:
df.drop(['Year', 'Kilometers_Driven', 'Owner_Type'], axis=1, inplace=True)

In [24]:
df.head()

,Location,Fuel_Type,Transmission,Mileage,Engine,Power,Seats,Price,Car_Companies,Car_model
0,Mumbai,CNG,Manual,26.6 km/kg,998 CC,58.16 bhp,5.0,1.75,Maruti,wagon
1,Pune,Diesel,Manual,19.67 kmpl,1582 CC,126.2 bhp,5.0,12.50,Hyundai,creta
2,Chennai,Petrol,Manual,18.2 kmpl,1199 CC,88.7 bhp,5.0,4.50,Honda,jazz
3,Chennai,Diesel,Manual,20.77 kmpl,1248 CC,88.76 bhp,7.0,6.00,Maruti,ertiga
4,Coimbatore,Diesel,Automatic,15.2 kmpl,1968 CC,140.8 bhp,5.0,17.74,Audi,a4

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Location       6019 non-null   object
 1   Fuel_Type      6019 non-null   object
 2   Transmission   6019 non-null   object
 3   Mileage        6017 non-null   object
 4   Engine         5983 non-null   object
 5   Power          5983 non-null   object
 6   Seats          5977 non-null   float64
 7   Price          6019 non-null   float64
 8   Car_Companies  6019 non-null   object
 9   Car_model      6019 non-null   object
dtypes: float64(2), object(8)
memory usage: 470.4+ KB

In [26]:
def convert_to_number(x):
    res = ''
    for char in x:
        if char.isdigit() or char =='.':
            res += char
    try :
        return float(res)
    except :
        return None

convert_to_number('998 CC')

998.0

In [27]:
df['Engine']

0        998 CC
1       1582 CC
2       1199 CC
3       1248 CC
4       1968 CC
         ...
6014    1248 CC
6015    1120 CC
6016    2498 CC
6017     998 CC
6018     936 CC
Name: Engine, Length: 6019, dtype: object

In [28]:
df['Engine'] = df['Engine'].apply(lambda x : convert_to_number(str(x)))

In [29]:
df['Mileage'] = df['Mileage'].apply(lambda x : convert_to_number(str(x)))

In [30]:
df['Power'] = df['Power'].apply(lambda x : convert_to_number(str(x)))

In [31]:
df.head()

,Location,Fuel_Type,Transmission,Mileage,Engine,Power,Seats,Price,Car_Companies,Car_model
0,Mumbai,CNG,Manual,26.60,998.0,58.16,5.0,1.75,Maruti,wagon
1,Pune,Diesel,Manual,19.67,1582.0,126.20,5.0,12.50,Hyundai,creta
2,Chennai,Petrol,Manual,18.20,1199.0,88.70,5.0,4.50,Honda,jazz
3,Chennai,Diesel,Manual,20.77,1248.0,88.76,7.0,6.00,Maruti,ertiga
4,Coimbatore,Diesel,Automatic,15.20,1968.0,140.80,5.0,17.74,Audi,a4

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Location       6019 non-null   object
 1   Fuel_Type      6019 non-null   object
 2   Transmission   6019 non-null   object
 3   Mileage        6017 non-null   float64
 4   Engine         5983 non-null   float64
 5   Power          5876 non-null   float64
 6   Seats          5977 non-null   float64
 7   Price          6019 non-null   float64
 8   Car_Companies  6019 non-null   object
 9   Car_model      6019 non-null   object
dtypes: float64(5), object(5)
memory usage: 470.4+ KB

In [33]:
fuel_types_list = df['Fuel_Type'].unique().tolist()
transmission_type_list = df['Transmission'].unique().tolist()

In [34]:
df2 = df[(df['Fuel_Type'] == 'Petrol') & (df['Transmission'] == 'Automatic')]

In [35]:
df2.head()

,Location,Fuel_Type,Transmission,Mileage,Engine,Power,Seats,Price,Car_Companies,Car_model
11,Kolkata,Petrol,Automatic,16.80,1497.0,116.30,5.0,4.49,Honda,city
22,Mumbai,Petrol,Automatic,13.53,1984.0,177.01,5.0,23.50,Audi,a6
24,Kolkata,Petrol,Automatic,14.40,1598.0,103.60,5.0,2.85,Volkswagen,vento
44,Bangalore,Petrol,Automatic,14.62,1999.0,149.92,5.0,8.85,Hyundai,elantra
45,Mumbai,Petrol,Automatic,14.28,1798.0,138.03,5.0,10.11,Toyota,corolla

In [36]:
filtered_data = {}
for fuel_type in fuel_types_list:
    for transmission in transmission_type_list:
        filtered_data[f'df_{fuel_type}_{transmission}'] = df[(df['Fuel_Type'] == fuel_type) & (df['Transmission'] == transmission)]

In [37]:
filtered_data.keys()

dict_keys(['df_CNG_Manual', 'df_CNG_Automatic', 'df_Diesel_Manual', 'df_Diesel_Automatic', 'df_Petrol_Manual', 'df_Petrol_Automatic', 'df_LPG_Manual', 'df_LPG_Automatic', 'df_Electric_Manual', 'df_Electric_Automatic'])

In [38]:
filtered_data.pop('df_CNG_Automatic')
filtered_data.pop('df_LPG_Automatic')
filtered_data.pop('df_Electric_Manual')

Empty DataFrame
Columns: [Location, Fuel_Type, Transmission, Mileage, Engine, Power, Seats, Price, Car_Companies, Car_model]
Index: []

In [39]:
filtered_data.keys()

dict_keys(['df_CNG_Manual', 'df_Diesel_Manual', 'df_Diesel_Automatic', 'df_Petrol_Manual', 'df_Petrol_Automatic', 'df_LPG_Manual', 'df_Electric_Automatic'])

In [40]:
filtered_data_engine_mean = {}

for _key, _df in filtered_data.items():
    filtered_data_engine_mean[f"{_key}_engine_mean"] = _df['Engine'].mean()

In [41]:
filtered_data_engine_mean

{'df_CNG_Manual_engine_mean': 1091.0535714285713,
 'df_Diesel_Manual_engine_mean': 1635.5815839694656,
 'df_Diesel_Automatic_engine_mean': 2291.879200726612,
 'df_Petrol_Manual_engine_mean': 1238.1782835467045,
 'df_Petrol_Automatic_engine_mean': 1747.1231527093596,
 'df_LPG_Manual_engine_mean': 1027.4,
 'df_Electric_Automatic_engine_mean': 935.0}

In [42]:
filtered_data_mileage_mean = {}

for _key, _df in filtered_data.items():
    filtered_data_mileage_mean[f"{_key}_mileage_mean"] = _df['Mileage'].mean()

In [43]:
filtered_data_power_mean = {}

for _key, _df in filtered_data.items():
    filtered_data_power_mean[f"{_key}_power_mean"] = _df['Power'].mean()

In [44]:
filtered_data_mileage_mean, filtered_data_power_mean

({'df_CNG_Manual_mileage_mean': 25.41803571428571,
  'df_Diesel_Manual_mileage_mean': 20.164668574153552,
  'df_Diesel_Automatic_mileage_mean': 15.697960288808664,
  'df_Petrol_Manual_mileage_mean': 17.88815074906367,
  'df_Petrol_Automatic_mileage_mean': 15.759114754098363,
  'df_LPG_Manual_mileage_mean': 19.384999999999998,
  'df_Electric_Automatic_mileage_mean': nan},
 {'df_CNG_Manual_power_mean': 64.83090909090909,
  'df_Diesel_Manual_power_mean': 98.35133885102239,
  'df_Diesel_Automatic_power_mean': 183.13458598726115,
  'df_Petrol_Manual_power_mean': 84.68131027764248,
  'df_Petrol_Automatic_power_mean': 139.4142288557214,
  'df_LPG_Manual_power_mean': 59.915000000000006,
  'df_Electric_Automatic_power_mean': 57.0})